Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ_EF_DFP/1.0.28/atdf/PIC32MZ1024EFK144.atdf
      <value-group caption="Digital Comparator x Enable bit" name="ADCCMPCON4__ENDCMP">
         <value caption="Digital Comparator x is enabled" name="" value="0x1"/>
         <value caption="Digital Comparator x is not enabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="Digital Comparator x Analog Input Identification bits" name="ADCCMPCON4__AINID">
         <value caption="AN31 is being monitored" name="" value="0x1f"/>
         <value caption="AN30 is being monitored" name="" value="0x1e"/>
         <value caption="AN1 is being monitored" name="" value="0x1"/>
         <value caption="AN0 is being monitored" name="" value="0x0"/>
      </value-group>
      <value-group caption="Low/Low Digital Comparator x Event bit" name="ADCCMPCON5__IELOLO">
         <value caption="Generate a Digital Comparator x Event when the DATA bits &lt; DCMPLO&lt;15:0&gt; bits" name="" value="0x1"/>
         <value caption="Do not generate an event" name="" value="0x0"/>
      </value-group>
      <value-group caption="Low/High Digital Comparator x Event bit" name="ADCCMPCON5__IELOHI">
         <value caption="Generate a Digital Comparator x Event when the DCMPLO &lt; DATA&lt;31:0&gt; bits" name="" value="0x1"/>
         <value caption="Do not generate an event" name="" value="0x0"/>
      </value-group>
      <value-group caption="High/Low Digital Comparator x Event bit" name="ADCCMPCON5__IEHILO">
         <value caption="Generate a Digital Comparator x Event when the DATA bits &lt; DCMPHI&lt;15:0&gt; bits" name="" value="0x1"/>
         <value caption="Do not generate an event" name="" value="0x0"/>
      </value-group>
      <value-group caption="High/High Digital Comparator x Event bit" name="ADCCMPCON5__IEHIHI">
         <value caption="Generate a Digital Comparator x Event when the DCMPHI &lt; DATA&lt;31:0&gt; bits" name="" value="0x1"/>
         <value caption="Do not generate an event" name="" value="0x0"/>
      </value-group>
      <value-group caption="Between Low/High Digital Comparator x Event bit" name="ADCCMPCON5__IEBTWN">
         <value caption="Generate a digital comparator event when the DCMPLO &lt; DATA&lt;31:0&gt; bits&lt; DCMPHI&lt;15:0&gt; bits" name="" value="0x1"/>
         <value caption="Do not generate a digital comparator event" name="" value="0x0"/>
      </value-group>
      <value-group caption="Digital Comparator x Output True Event Status bit" name="ADCCMPCON5__DCMPED">
         <value caption="Digital Comparator x output true event has occurred (output of Comparator is 1)" name="" value="0x1"/>
         <value caption="Digital Comparator x output is false (output of Comparator is 0)" name="" value="0x0"/>
      </value-group>
      <value-group caption="Digital Comparator x Global Interrupt Enable bit" name="ADCCMPCON5__DCMPGIEN">
         <value caption="A Digital Comparator x interrupt is generated when the DCMPED status bit (ADCCMPxCON) is set" name="" value="0x1"/>
         <value caption="A Digital Comparator x interrupt is disabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="Digital Comparator x Enable bit" name="ADCCMPCON5__ENDCMP">
         <value caption="Digital Comparator x is enabled" name="" value="0x1"/>
         <value caption="Digital Comparator x is not enabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="Digital Comparator x Analog Input Identification bits" name="ADCCMPCON5__AINID">
         <value caption="AN31 is being monitored" name="" value="0x1f"/>
         <value caption="AN30 is being monitored" name="" value="0x1e"/>
         <value caption="AN1 is being monitored" name="" value="0x1"/>
         <value caption="AN0 is being monitored" name="" value="0x0"/>
      </value-group>
      <value-group caption="Low/Low Digital Comparator x Event bit" name="ADCCMPCON6__IELOLO">
         <value caption="Generate a Digital Comparator x Event when the DATA bits &lt; DCMPLO&lt;15:0&gt; bits" name="" value="0x1"/>
         <value caption="Do not generate an event" name="" value="0x0"/>
      </value-group>
      <value-group caption="Low/High Digital Comparator x Event bit" name="ADCCMPCON6__IELOHI">
         <value caption="Generate a Digital Comparator x Event when the DCMPLO &lt; DATA&lt;31:0&gt; bits" name="" value="0x1"/>
         <value caption="Do not generate an event" name="" value="0x0"/>
      </value-group>
      <value-group caption="High/Low Digital Comparator x Event bit" name="ADCCMPCON6__IEHILO">
         <value caption="Generate a Digital Comparator x Event when the DATA bits &lt; DCMPHI&lt;15:0&gt; bits" name="" value="0x1"/>
         <value caption="Do not generate an event" name="" value="0x0"/>
      </value-group>
      <value-group caption="High/High Digital Comparator x Event bit" name="ADCCMPCON6__IEHIHI">
         <value caption="Generate a Digital Comparator x Event when the DCMPHI &lt; DATA&lt;31:0&gt; bits" name="" value="0x1"/>
         <value caption="Do not generate an event" name="" value="0x0"/>
      </value-group>
      <value-group caption="Between Low/High Digital Comparator x Event bit" name="ADCCMPCON6__IEBTWN">
         <value caption="Generate a digital comparator event when the DCMPLO &lt; DATA&lt;31:0&gt; bits&lt; DCMPHI&lt;15:0&gt; bits" name="" value="0x1"/>
         <value caption="Do not generate a digital comparator event" name="" value="0x0"/>
      </value-group>
      <value-group caption="Digital Comparator x Output True Event Status bit" name="ADCCMPCON6__DCMPED">
         <value caption="Digital Comparator x output true event has occurred (output of Comparator is 1)" name="" value="0x1"/>
         <value caption="Digital Comparator x output is false (output of Comparator is 0)" name="" value="0x0"/>
      </value-group>
      <value-group caption="Digital Comparator x Global Interrupt Enable bit" name="ADCCMPCON6__DCMPGIEN">
         <value caption="A Digital Comparator x interrupt is generated when the DCMPED status bit (ADCCMPxCON) is set" name="" value="0x1"/>
         <value caption="A Digital Comparator x interrupt is disabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="Digital Comparator x Enable bit" name="ADCCMPCON6__ENDCMP">
         <value caption="Digital Comparator x is enabled" name="" value="0x1"/>
         <value caption="Digital Comparator x is not enabled" name="" value="0x0"/>
      </value-group>
