Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ_EF_DFP/1.0.28/atdf/PIC32MZ1024EFK144.atdf
      <value-group caption="Filter 20 Enable bit" name="C1FLTCON5__FLTEN20">
         <value caption="Filter is enabled" name="" value="0x1"/>
         <value caption="Filter is disabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="FIFO Selection bits" name="C1FLTCON5__FSEL21">
         <value caption="Message matching filter is stored in FIFO buffer 31" name="" value="0x1f"/>
         <value caption="Message matching filter is stored in FIFO buffer 30" name="" value="0x1e"/>
         <value caption="Message matching filter is stored in FIFO buffer 1" name="" value="0x1"/>
         <value caption="Message matching filter is stored in FIFO buffer 0" name="" value="0x0"/>
      </value-group>
      <value-group caption="Filter 21 Mask Select bits" name="C1FLTCON5__MSEL21">
         <value caption="Acceptance Mask 3 selected" name="" value="0x3"/>
         <value caption="Acceptance Mask 2 selected" name="" value="0x2"/>
         <value caption="Acceptance Mask 1 selected" name="" value="0x1"/>
         <value caption="Acceptance Mask 0 selected" name="" value="0x0"/>
      </value-group>
      <value-group caption="Filter 21 Enable bit" name="C1FLTCON5__FLTEN21">
         <value caption="Filter is enabled" name="" value="0x1"/>
         <value caption="Filter is disabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="FIFO Selection bits" name="C1FLTCON5__FSEL22">
         <value caption="Message matching filter is stored in FIFO buffer 31" name="" value="0x1f"/>
         <value caption="Message matching filter is stored in FIFO buffer 30" name="" value="0x1e"/>
         <value caption="Message matching filter is stored in FIFO buffer 1" name="" value="0x1"/>
         <value caption="Message matching filter is stored in FIFO buffer 0" name="" value="0x0"/>
      </value-group>
      <value-group caption="Filter 22 Mask Select bits" name="C1FLTCON5__MSEL22">
         <value caption="Acceptance Mask 3 selected" name="" value="0x3"/>
         <value caption="Acceptance Mask 2 selected" name="" value="0x2"/>
         <value caption="Acceptance Mask 1 selected" name="" value="0x1"/>
         <value caption="Acceptance Mask 0 selected" name="" value="0x0"/>
      </value-group>
      <value-group caption="Filter 22 Enable bit" name="C1FLTCON5__FLTEN22">
         <value caption="Filter is enabled" name="" value="0x1"/>
         <value caption="Filter is disabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="FIFO Selection bits" name="C1FLTCON5__FSEL23">
         <value caption="Message matching filter is stored in FIFO buffer 31" name="" value="0x1f"/>
         <value caption="Message matching filter is stored in FIFO buffer 30" name="" value="0x1e"/>
         <value caption="Message matching filter is stored in FIFO buffer 1" name="" value="0x1"/>
         <value caption="Message matching filter is stored in FIFO buffer 0" name="" value="0x0"/>
      </value-group>
      <value-group caption="Filter 23 Mask Select bits" name="C1FLTCON5__MSEL23">
         <value caption="Acceptance Mask 3 selected" name="" value="0x3"/>
         <value caption="Acceptance Mask 2 selected" name="" value="0x2"/>
         <value caption="Acceptance Mask 1 selected" name="" value="0x1"/>
         <value caption="Acceptance Mask 0 selected" name="" value="0x0"/>
      </value-group>
      <value-group caption="Filter 23 Enable bit" name="C1FLTCON5__FLTEN23">
         <value caption="Filter is enabled" name="" value="0x1L"/>
         <value caption="Filter is disabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="FIFO Selection bits" name="C2FLTCON5__FSEL20">
         <value caption="Message matching filter is stored in FIFO buffer 31" name="" value="0x1f"/>
         <value caption="Message matching filter is stored in FIFO buffer 30" name="" value="0x1e"/>
         <value caption="Message matching filter is stored in FIFO buffer 1" name="" value="0x1"/>
         <value caption="Message matching filter is stored in FIFO buffer 0" name="" value="0x0"/>
      </value-group>
      <value-group caption="Filter 20 Mask Select bits" name="C2FLTCON5__MSEL20">
         <value caption="Acceptance Mask 3 selected" name="" value="0x3"/>
         <value caption="Acceptance Mask 2 selected" name="" value="0x2"/>
         <value caption="Acceptance Mask 1 selected" name="" value="0x1"/>
         <value caption="Acceptance Mask 0 selected" name="" value="0x0"/>
      </value-group>
      <value-group caption="Filter 20 Enable bit" name="C2FLTCON5__FLTEN20">
         <value caption="Filter is enabled" name="" value="0x1"/>
         <value caption="Filter is disabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="FIFO Selection bits" name="C2FLTCON5__FSEL21">
         <value caption="Message matching filter is stored in FIFO buffer 31" name="" value="0x1f"/>
         <value caption="Message matching filter is stored in FIFO buffer 30" name="" value="0x1e"/>
         <value caption="Message matching filter is stored in FIFO buffer 1" name="" value="0x1"/>
         <value caption="Message matching filter is stored in FIFO buffer 0" name="" value="0x0"/>
      </value-group>
      <value-group caption="Filter 21 Mask Select bits" name="C2FLTCON5__MSEL21">
         <value caption="Acceptance Mask 3 selected" name="" value="0x3"/>
         <value caption="Acceptance Mask 2 selected" name="" value="0x2"/>
         <value caption="Acceptance Mask 1 selected" name="" value="0x1"/>
         <value caption="Acceptance Mask 0 selected" name="" value="0x0"/>
      </value-group>
      <value-group caption="Filter 21 Enable bit" name="C2FLTCON5__FLTEN21">
         <value caption="Filter is enabled" name="" value="0x1"/>
         <value caption="Filter is disabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="FIFO Selection bits" name="C2FLTCON5__FSEL22">
         <value caption="Message matching filter is stored in FIFO buffer 31" name="" value="0x1f"/>
         <value caption="Message matching filter is stored in FIFO buffer 30" name="" value="0x1e"/>
         <value caption="Message matching filter is stored in FIFO buffer 1" name="" value="0x1"/>
         <value caption="Message matching filter is stored in FIFO buffer 0" name="" value="0x0"/>
      </value-group>
      <value-group caption="Filter 22 Mask Select bits" name="C2FLTCON5__MSEL22">
         <value caption="Acceptance Mask 3 selected" name="" value="0x3"/>
         <value caption="Acceptance Mask 2 selected" name="" value="0x2"/>
         <value caption="Acceptance Mask 1 selected" name="" value="0x1"/>
         <value caption="Acceptance Mask 0 selected" name="" value="0x0"/>
      </value-group>
