Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ_EF_DFP/1.0.28/atdf/PIC32MZ1024EFK144.atdf
         <register caption="Reference Oscillator Control Register (x = 1-4)" name="REFO4CON" offset="0xe0" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="ROSEL"/>
            <bitfield caption="Reference Clock Request Status bit" mask="0x00000100" name="ACTIVE" values="REFO4CON__ACTIVE"/>
            <bitfield caption="Divider Switch Enable bit" mask="0x00000200" name="DIVSWEN" values="REFO4CON__DIVSWEN"/>
            <bitfield caption="Reference Oscillator Module Run in Sleep bit" mask="0x00000800" name="RSLP" values="REFO4CON__RSLP"/>
            <bitfield caption="Reference Clock Output Enable bit" mask="0x00001000" name="OE" values="REFO4CON__OE"/>
            <bitfield caption="Peripheral Stop in Idle Mode bit" mask="0x00002000" name="SIDL" values="REFO4CON__SIDL"/>
            <bitfield caption="Output Enable bit" mask="0x00008000" name="ON" values="REFO4CON__ON"/>
            <bitfield caption="Reference Clock Divider bits" mask="0x7FFF0000" name="RODIV" values="REFO4CON__RODIV"/>
         </register>
         <register caption="Reference Oscillator Trim Register (x = 1-4)" name="REFO1TRIM" offset="0x90" rw="RW" size="4">
            <bitfield caption="Reference Oscillator Trim bits" mask="0xFF800000" name="ROTRIM" values="REFO1TRIM__ROTRIM"/>
         </register>
         <register caption="Reference Oscillator Trim Register (x = 1-4)" name="REFO2TRIM" offset="0xb0" rw="RW" size="4">
            <bitfield caption="Reference Oscillator Trim bits" mask="0xFF800000" name="ROTRIM" values="REFO2TRIM__ROTRIM"/>
         </register>
         <register caption="Reference Oscillator Trim Register (x = 1-4)" name="REFO3TRIM" offset="0xd0" rw="RW" size="4">
            <bitfield caption="Reference Oscillator Trim bits" mask="0xFF800000" name="ROTRIM" values="REFO3TRIM__ROTRIM"/>
         </register>
         <register caption="Reference Oscillator Trim Register (x = 1-4)" name="REFO4TRIM" offset="0xf0" rw="RW" size="4">
            <bitfield caption="Reference Oscillator Trim bits" mask="0xFF800000" name="ROTRIM" values="REFO4TRIM__ROTRIM"/>
         </register>
         <register caption="Peripheral Bus x Clock Divisor Control Register (x = 1-7)" name="PB1DIV" offset="0x100" rw="RW" size="4">
            <bitfield caption="Peripheral Bus x Clock Divisor Control bits" mask="0x0000007F" name="PBDIV" values="PB1DIV__PBDIV"/>
            <bitfield caption="Peripheral Bus x Clock Divisor Ready bit" mask="0x00000800" name="PBDIVRDY" values="PB1DIV__PBDIVRDY"/>
            <bitfield caption="Peripheral Bus x Output Clock Enable bit" mask="0x00008000" name="ON" values="PB1DIV__ON"/>
         </register>
         <register caption="Peripheral Bus x Clock Divisor Control Register (x = 1-7)" name="PB2DIV" offset="0x110" rw="RW" size="4">
            <bitfield caption="Peripheral Bus x Clock Divisor Control bits" mask="0x0000007F" name="PBDIV" values="PB2DIV__PBDIV"/>
            <bitfield caption="Peripheral Bus x Clock Divisor Ready bit" mask="0x00000800" name="PBDIVRDY" values="PB2DIV__PBDIVRDY"/>
            <bitfield caption="Peripheral Bus x Output Clock Enable bit" mask="0x00008000" name="ON" values="PB2DIV__ON"/>
         </register>
         <register caption="Peripheral Bus x Clock Divisor Control Register (x = 1-7)" name="PB3DIV" offset="0x120" rw="RW" size="4">
            <bitfield caption="Peripheral Bus x Clock Divisor Control bits" mask="0x0000007F" name="PBDIV" values="PB3DIV__PBDIV"/>
            <bitfield caption="Peripheral Bus x Clock Divisor Ready bit" mask="0x00000800" name="PBDIVRDY" values="PB3DIV__PBDIVRDY"/>
            <bitfield caption="Peripheral Bus x Output Clock Enable bit" mask="0x00008000" name="ON" values="PB3DIV__ON"/>
         </register>
         <register caption="Peripheral Bus x Clock Divisor Control Register (x = 1-7)" name="PB4DIV" offset="0x130" rw="RW" size="4">
            <bitfield caption="Peripheral Bus x Clock Divisor Control bits" mask="0x0000007F" name="PBDIV" values="PB4DIV__PBDIV"/>
            <bitfield caption="Peripheral Bus x Clock Divisor Ready bit" mask="0x00000800" name="PBDIVRDY" values="PB4DIV__PBDIVRDY"/>
            <bitfield caption="Peripheral Bus x Output Clock Enable bit" mask="0x00008000" name="ON" values="PB4DIV__ON"/>
         </register>
         <register caption="Peripheral Bus x Clock Divisor Control Register (x = 1-7)" name="PB5DIV" offset="0x140" rw="RW" size="4">
            <bitfield caption="Peripheral Bus x Clock Divisor Control bits" mask="0x0000007F" name="PBDIV" values="PB5DIV__PBDIV"/>
            <bitfield caption="Peripheral Bus x Clock Divisor Ready bit" mask="0x00000800" name="PBDIVRDY" values="PB5DIV__PBDIVRDY"/>
            <bitfield caption="Peripheral Bus x Output Clock Enable bit" mask="0x00008000" name="ON" values="PB5DIV__ON"/>
         </register>
         <register caption="Peripheral Bus x Clock Divisor Control Register (x = 1-7)" name="PB7DIV" offset="0x160" rw="RW" size="4">
            <bitfield caption="Peripheral Bus x Clock Divisor Control bits" mask="0x0000007F" name="PBDIV" values="PB7DIV__PBDIV"/>
            <bitfield caption="Peripheral Bus x Clock Divisor Ready bit" mask="0x00000800" name="PBDIVRDY" values="PB7DIV__PBDIVRDY"/>
            <bitfield caption="Peripheral Bus x Output Clock Enable bit" mask="0x00008000" name="ON" values="PB7DIV__ON"/>
         </register>
         <register caption="Peripheral Bus x Clock Divisor Control Register (x = 1-7)" name="PB8DIV" offset="0x170" rw="RW" size="4">
            <bitfield caption="Peripheral Bus x Clock Divisor Control bits" mask="0x0000007F" name="PBDIV" values="PB8DIV__PBDIV"/>
            <bitfield caption="Peripheral Bus x Clock Divisor Ready bit" mask="0x00000800" name="PBDIVRDY" values="PB8DIV__PBDIVRDY"/>
            <bitfield caption="Peripheral Bus x Output Clock Enable bit" mask="0x00008000" name="ON" values="PB8DIV__ON"/>
         </register>
         <register caption="Oscillator Slew Control Register" name="SLEWCON" offset="0x1c0" rw="RW" size="4">
            <bitfield caption="Clock Switching Slewing Active Status bit" mask="0x00000001" name="BUSY" values="SLEWCON__BUSY"/>
            <bitfield caption="Downward Slew Enable bit" mask="0x00000002" name="DNEN" values="SLEWCON__DNEN"/>
            <bitfield caption="Upward Slew Enable bit" mask="0x00000004" name="UPEN" values="SLEWCON__UPEN"/>
            <bitfield caption="Slew Divisor Steps Control bits" mask="0x00000700" name="SLWDIV" values="SLEWCON__SLWDIV"/>
            <bitfield caption="System Clock Divide Control bits" mask="0x000F0000" name="SYSDIV" values="SLEWCON__SYSDIV"/>
         </register>
         <register caption="Oscillator Clock Status Register" name="CLKSTAT" offset="0x1d0" rw="RW" size="4">
            <bitfield caption="Fast RC Oscillator Ready Status bit" mask="0x00000001" name="FRCRDY" values="CLKSTAT__FRCRDY"/>
            <bitfield mask="0x00000002" name="SPDIVRDY"/>
            <bitfield caption="Primary Oscillator Ready Status bit" mask="0x00000004" name="POSCRDY" values="CLKSTAT__POSCRDY"/>
            <bitfield mask="0x00000008" name="DCORDY"/>
            <bitfield caption="Secondary Oscillator Ready Status bit" mask="0x00000010" name="SOSCRDY" values="CLKSTAT__SOSCRDY"/>
            <bitfield caption="Low-Power RC Oscillator Ready Status bit" mask="0x00000020" name="LPRCRDY" values="CLKSTAT__LPRCRDY"/>
            <bitfield mask="0x00000080" name="SPLLRDY"/>
         </register>
      </register-group>
