Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ_EF_DFP/1.0.28/atdf/PIC32MZ1024EFK144.atdf
         <register caption="" name="OFF205" offset="0x874" rw="RW" size="4">
            <bitfield mask="0x0003FFFE" name="VOFF"/>
         </register>
         <register caption="" name="OFF206" offset="0x878" rw="RW" size="4">
            <bitfield mask="0x0003FFFE" name="VOFF"/>
         </register>
         <register caption="" name="OFF207" offset="0x87c" rw="RW" size="4">
            <bitfield mask="0x0003FFFE" name="VOFF"/>
         </register>
         <register caption="" name="OFF208" offset="0x880" rw="RW" size="4">
            <bitfield mask="0x0003FFFE" name="VOFF"/>
         </register>
         <register caption="" name="OFF209" offset="0x884" rw="RW" size="4">
            <bitfield mask="0x0003FFFE" name="VOFF"/>
         </register>
         <register caption="" name="OFF210" offset="0x888" rw="RW" size="4">
            <bitfield mask="0x0003FFFE" name="VOFF"/>
         </register>
         <register caption="" name="OFF213" offset="0x894" rw="RW" size="4">
            <bitfield mask="0x0003FFFE" name="VOFF"/>
         </register>
      </register-group>
      <value-group caption="External Interrupt 0 Edge" name="INTCON__INT0EP">
         <value caption="Rising edge" name="" value="0x1"/>
         <value caption="Falling edge" name="" value="0x0"/>
      </value-group>
      <value-group caption="External Interrupt 1 Edge" name="INTCON__INT1EP">
         <value caption="Rising edge" name="" value="0x1"/>
         <value caption="Falling edge" name="" value="0x0"/>
      </value-group>
      <value-group caption="External Interrupt 2 Edge" name="INTCON__INT2EP">
         <value caption="Rising edge" name="" value="0x1"/>
         <value caption="Falling edge" name="" value="0x0"/>
      </value-group>
      <value-group caption="External Interrupt 3 Edge" name="INTCON__INT3EP">
         <value caption="Rising edge" name="" value="0x1"/>
         <value caption="Falling edge" name="" value="0x0"/>
      </value-group>
      <value-group caption="External Interrupt 4 Edge" name="INTCON__INT4EP">
         <value caption="Rising edge" name="" value="0x1"/>
         <value caption="Falling edge" name="" value="0x0"/>
      </value-group>
      <value-group caption="Interrupt Proximity Timer Control bits" name="INTCON__TPC">
         <value caption="Interrupts of group priority 7 or lower start the Interrupt Proximity timer" name="" value="0x7"/>
         <value caption="Interrupts of group priority 6 or lower start the Interrupt Proximity timer" name="" value="0x6"/>
         <value caption="Interrupts of group priority 5 or lower start the Interrupt Proximity timer" name="" value="0x5"/>
         <value caption="Interrupts of group priority 4 or lower start the Interrupt Proximity timer" name="" value="0x4"/>
         <value caption="Interrupts of group priority 3 or lower start the Interrupt Proximity timer" name="" value="0x3"/>
         <value caption="Interrupts of group priority 2 or lower start the Interrupt Proximity timer" name="" value="0x2"/>
         <value caption="Interrupts of group priority 1 start the Interrupt Proximity timer" name="" value="0x1"/>
         <value caption="Disables Interrupt Proximity timer" name="" value="0x0"/>
      </value-group>
      <value-group caption="Multi Vector Configuration bit" name="INTCON__MVEC">
         <value caption="Interrupt controller configured for multi vectored mode" name="" value="0x1"/>
         <value caption="Interrupt controller configured for single vectored mode" name="" value="0x0"/>
      </value-group>
      <value-group caption="Single Vector Shadow Register Set bit" name="PRISS__SS0">
         <value caption="Single vector is presented with a shadow set" name="" value="0x1"/>
         <value caption="Single vector is not presented with a shadow set" name="" value="0x0"/>
      </value-group>
      <value-group caption="Interrupt with Priority Level 1 Shadow Set bits " name="PRISS__PRI1SS">
         <value caption="Reserved (by default" name="" value="1xxx"/>
         <value caption="Interrupt with a priority level of 1 uses Shadow Set 7" name="" value="0x7"/>
         <value caption="Interrupt with a priority level of 1 uses Shadow Set 6" name="" value="0x6"/>
         <value caption="Interrupt with a priority level of 1 uses Shadow Set 1" name="" value="0x1"/>
         <value caption="Interrupt with a priority level of 1 uses Shadow Set 0" name="" value="0x0"/>
      </value-group>
      <value-group caption="Interrupt with Priority Level 2 Shadow Set bits " name="PRISS__PRI2SS">
         <value caption="Reserved (by default" name="" value="1xxx"/>
         <value caption="Interrupt with a priority level of 2 uses Shadow Set 7" name="" value="0x7"/>
         <value caption="Interrupt with a priority level of 2 uses Shadow Set 6" name="" value="0x6"/>
         <value caption="Interrupt with a priority level of 2 uses Shadow Set 1" name="" value="0x1"/>
         <value caption="Interrupt with a priority level of 2 uses Shadow Set 0" name="" value="0x0"/>
      </value-group>
      <value-group caption="Interrupt with Priority Level 3 Shadow Set bits " name="PRISS__PRI3SS">
         <value caption="Reserved (by default" name="" value="1xxx"/>
         <value caption="Interrupt with a priority level of 3 uses Shadow Set 7" name="" value="0x7"/>
         <value caption="Interrupt with a priority level of 3 uses Shadow Set 6" name="" value="0x6"/>
         <value caption="Interrupt with a priority level of 3 uses Shadow Set 1" name="" value="0x1"/>
         <value caption="Interrupt with a priority level of 3 uses Shadow Set 0" name="" value="0x0"/>
      </value-group>
      <value-group caption="Interrupt with Priority Level 4 Shadow Set bits " name="PRISS__PRI4SS">
         <value caption="Reserved (by default" name="" value="1xxx"/>
         <value caption="Interrupt with a priority level of 4 uses Shadow Set 7" name="" value="0x7"/>
         <value caption="Interrupt with a priority level of 4 uses Shadow Set 6" name="" value="0x6"/>
         <value caption="Interrupt with a priority level of 4 uses Shadow Set 1" name="" value="0x1"/>
         <value caption="Interrupt with a priority level of 4 uses Shadow Set 0" name="" value="0x0"/>
      </value-group>
      <value-group caption="Interrupt with Priority Level 5 Shadow Set bits " name="PRISS__PRI5SS">
         <value caption="Reserved (by default" name="" value="1xxx"/>
         <value caption="Interrupt with a priority level of 5 uses Shadow Set 7" name="" value="0x7"/>
         <value caption="Interrupt with a priority level of 5 uses Shadow Set 6" name="" value="0x6"/>
         <value caption="Interrupt with a priority level of 5 uses Shadow Set 1" name="" value="0x1"/>
         <value caption="Interrupt with a priority level of 5 uses Shadow Set 0" name="" value="0x0"/>
      </value-group>
      <value-group caption="Interrupt with Priority Level 6 Shadow Set bits " name="PRISS__PRI6SS">
         <value caption="Reserved (by default" name="" value="1xxx"/>
         <value caption="Interrupt with a priority level of 6 uses Shadow Set 7" name="" value="0x7"/>
         <value caption="Interrupt with a priority level of 6 uses Shadow Set 6" name="" value="0x6"/>
         <value caption="Interrupt with a priority level of 6 uses Shadow Set 1" name="" value="0x1"/>
         <value caption="Interrupt with a priority level of 6 uses Shadow Set 0" name="" value="0x0"/>
      </value-group>
      <value-group caption="Interrupt with Priority Level 7 Shadow Set bits " name="PRISS__PRI7SS">
         <value caption="Reserved (by default" name="" value="1xxx"/>
         <value caption="Interrupt with a priority level of 7 uses Shadow Set 7" name="" value="0x7"/>
         <value caption="Interrupt with a priority level of 7 uses Shadow Set 6" name="" value="0x6"/>
         <value caption="Interrupt with a priority level of 7 uses Shadow Set 1" name="" value="0x1"/>
         <value caption="Interrupt with a priority level of 7 uses Shadow Set 0" name="" value="0x0"/>
      </value-group>
      <value-group caption="Requested Priority Level bits for Single Vector Mode bits " name="INTSTAT__SRIPL">
         <value caption="The priority level of the latest interrupt presented to the CPU" name="" value="111-000"/>
      </value-group>
   </module>
