Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ_EF_DFP/1.0.28/atdf/PIC32MZ1024EFK144.atdf
         <register caption="UARTx Status and Control Register" name="U3STA" offset="0x410" rw="RW" size="4">
            <bitfield mask="0x00000001" name="URXDA"/>
            <bitfield caption="Receive Buffer Overrun Error Status bit." mask="0x00000002" name="OERR" values="U3STA__OERR"/>
            <bitfield caption="Framing Error Status bit" mask="0x00000004" name="FERR" values="U3STA__FERR"/>
            <bitfield caption="Parity Error Status bit" mask="0x00000008" name="PERR" values="U3STA__PERR"/>
            <bitfield caption="Receiver Idle bit" mask="0x00000010" name="RIDLE" values="U3STA__RIDLE"/>
            <bitfield caption="Address Character Detect bit" mask="0x00000020" name="ADDEN" values="U3STA__ADDEN"/>
            <bitfield caption="Receive Interrupt Mode Selection bit" mask="0x000000C0" name="URXISEL" values="U3STA__URXISEL"/>
            <bitfield mask="0x00000100" name="TRMT"/>
            <bitfield caption="Transmit Buffer Full Status bit" mask="0x00000200" name="UTXBF" values="U3STA__UTXBF"/>
            <bitfield caption="Transmit Enable bit" mask="0x00000400" name="UTXEN" values="U3STA__UTXEN"/>
            <bitfield caption="Transmit Break bit" mask="0x00000800" name="UTXBRK" values="U3STA__UTXBRK"/>
            <bitfield caption="Receiver Enable bit" mask="0x00001000" name="URXEN" values="U3STA__URXEN"/>
            <bitfield caption="Transmit Polarity Inversion bit" mask="0x00002000" name="UTXINV" values="U3STA__UTXINV"/>
            <bitfield caption="TX Interrupt Mode Selection bits" mask="0x0000C000" name="UTXISEL" values="U3STA__UTXISEL"/>
            <bitfield mask="0x00FF0000" name="ADDR"/>
            <bitfield caption="Automatic Address Detect Mode Enable bit" mask="0x01000000" name="ADM_EN" values="U3STA__ADM_EN"/>
         </register>
         <register caption="UARTx Status and Control Register" name="U4STA" offset="0x610" rw="RW" size="4">
            <bitfield mask="0x00000001" name="URXDA"/>
            <bitfield caption="Receive Buffer Overrun Error Status bit." mask="0x00000002" name="OERR" values="U4STA__OERR"/>
            <bitfield caption="Framing Error Status bit" mask="0x00000004" name="FERR" values="U4STA__FERR"/>
            <bitfield caption="Parity Error Status bit" mask="0x00000008" name="PERR" values="U4STA__PERR"/>
            <bitfield caption="Receiver Idle bit" mask="0x00000010" name="RIDLE" values="U4STA__RIDLE"/>
            <bitfield caption="Address Character Detect bit" mask="0x00000020" name="ADDEN" values="U4STA__ADDEN"/>
            <bitfield caption="Receive Interrupt Mode Selection bit" mask="0x000000C0" name="URXISEL" values="U4STA__URXISEL"/>
            <bitfield mask="0x00000100" name="TRMT"/>
            <bitfield caption="Transmit Buffer Full Status bit" mask="0x00000200" name="UTXBF" values="U4STA__UTXBF"/>
            <bitfield caption="Transmit Enable bit" mask="0x00000400" name="UTXEN" values="U4STA__UTXEN"/>
            <bitfield caption="Transmit Break bit" mask="0x00000800" name="UTXBRK" values="U4STA__UTXBRK"/>
            <bitfield caption="Receiver Enable bit" mask="0x00001000" name="URXEN" values="U4STA__URXEN"/>
            <bitfield caption="Transmit Polarity Inversion bit" mask="0x00002000" name="UTXINV" values="U4STA__UTXINV"/>
            <bitfield caption="TX Interrupt Mode Selection bits" mask="0x0000C000" name="UTXISEL" values="U4STA__UTXISEL"/>
            <bitfield mask="0x00FF0000" name="ADDR"/>
            <bitfield caption="Automatic Address Detect Mode Enable bit" mask="0x01000000" name="ADM_EN" values="U4STA__ADM_EN"/>
         </register>
         <register caption="UARTx Status and Control Register" name="U5STA" offset="0x810" rw="RW" size="4">
            <bitfield mask="0x00000001" name="URXDA"/>
            <bitfield caption="Receive Buffer Overrun Error Status bit." mask="0x00000002" name="OERR" values="U5STA__OERR"/>
            <bitfield caption="Framing Error Status bit" mask="0x00000004" name="FERR" values="U5STA__FERR"/>
            <bitfield caption="Parity Error Status bit" mask="0x00000008" name="PERR" values="U5STA__PERR"/>
            <bitfield caption="Receiver Idle bit" mask="0x00000010" name="RIDLE" values="U5STA__RIDLE"/>
            <bitfield caption="Address Character Detect bit" mask="0x00000020" name="ADDEN" values="U5STA__ADDEN"/>
            <bitfield caption="Receive Interrupt Mode Selection bit" mask="0x000000C0" name="URXISEL" values="U5STA__URXISEL"/>
            <bitfield mask="0x00000100" name="TRMT"/>
            <bitfield caption="Transmit Buffer Full Status bit" mask="0x00000200" name="UTXBF" values="U5STA__UTXBF"/>
            <bitfield caption="Transmit Enable bit" mask="0x00000400" name="UTXEN" values="U5STA__UTXEN"/>
            <bitfield caption="Transmit Break bit" mask="0x00000800" name="UTXBRK" values="U5STA__UTXBRK"/>
            <bitfield caption="Receiver Enable bit" mask="0x00001000" name="URXEN" values="U5STA__URXEN"/>
            <bitfield caption="Transmit Polarity Inversion bit" mask="0x00002000" name="UTXINV" values="U5STA__UTXINV"/>
            <bitfield caption="TX Interrupt Mode Selection bits" mask="0x0000C000" name="UTXISEL" values="U5STA__UTXISEL"/>
            <bitfield mask="0x00FF0000" name="ADDR"/>
            <bitfield caption="Automatic Address Detect Mode Enable bit" mask="0x01000000" name="ADM_EN" values="U5STA__ADM_EN"/>
         </register>
         <register caption="UARTx Status and Control Register" name="U6STA" offset="0xa10" rw="RW" size="4">
            <bitfield mask="0x00000001" name="URXDA"/>
            <bitfield caption="Receive Buffer Overrun Error Status bit." mask="0x00000002" name="OERR" values="U6STA__OERR"/>
            <bitfield caption="Framing Error Status bit" mask="0x00000004" name="FERR" values="U6STA__FERR"/>
            <bitfield caption="Parity Error Status bit" mask="0x00000008" name="PERR" values="U6STA__PERR"/>
            <bitfield caption="Receiver Idle bit" mask="0x00000010" name="RIDLE" values="U6STA__RIDLE"/>
            <bitfield caption="Address Character Detect bit" mask="0x00000020" name="ADDEN" values="U6STA__ADDEN"/>
            <bitfield caption="Receive Interrupt Mode Selection bit" mask="0x000000C0" name="URXISEL" values="U6STA__URXISEL"/>
            <bitfield mask="0x00000100" name="TRMT"/>
            <bitfield caption="Transmit Buffer Full Status bit" mask="0x00000200" name="UTXBF" values="U6STA__UTXBF"/>
            <bitfield caption="Transmit Enable bit" mask="0x00000400" name="UTXEN" values="U6STA__UTXEN"/>
            <bitfield caption="Transmit Break bit" mask="0x00000800" name="UTXBRK" values="U6STA__UTXBRK"/>
            <bitfield caption="Receiver Enable bit" mask="0x00001000" name="URXEN" values="U6STA__URXEN"/>
            <bitfield caption="Transmit Polarity Inversion bit" mask="0x00002000" name="UTXINV" values="U6STA__UTXINV"/>
            <bitfield caption="TX Interrupt Mode Selection bits" mask="0x0000C000" name="UTXISEL" values="U6STA__UTXISEL"/>
            <bitfield mask="0x00FF0000" name="ADDR"/>
            <bitfield caption="Automatic Address Detect Mode Enable bit" mask="0x01000000" name="ADM_EN" values="U6STA__ADM_EN"/>
         </register>
         <register caption="" name="U1TXREG" offset="0x20" rw="RW" size="4">
            <bitfield mask="0x000001FF" name="U1TXREG"/>
         </register>
         <register caption="" name="U2TXREG" offset="0x220" rw="RW" size="4">
            <bitfield mask="0x000001FF" name="U2TXREG"/>
         </register>
         <register caption="" name="U3TXREG" offset="0x420" rw="RW" size="4">
            <bitfield mask="0x000001FF" name="U3TXREG"/>
         </register>
         <register caption="" name="U4TXREG" offset="0x620" rw="RW" size="4">
            <bitfield mask="0x000001FF" name="U4TXREG"/>
         </register>
         <register caption="" name="U5TXREG" offset="0x820" rw="RW" size="4">
            <bitfield mask="0x000001FF" name="U5TXREG"/>
         </register>
         <register caption="" name="U6TXREG" offset="0xa20" rw="RW" size="4">
            <bitfield mask="0x000001FF" name="U6TXREG"/>
         </register>
         <register caption="" name="U1RXREG" offset="0x30" rw="R" size="4">
            <bitfield mask="0x000001FF" name="U1RXREG"/>
         </register>
