Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ_EF_DFP/1.0.28/atdf/PIC32MZ1024EFK144.atdf
      <value-group caption="DMA Request Enable Control bit" name="USBIENCSR1__DMAREQEN">
         <value caption="Enable DMA requests for the RX endpoint." name="" value="0x1"/>
         <value caption="Disable DMA requests for the RX endpoint." name="" value="0x0"/>
      </value-group>
      <value-group caption="Isochronous Endpoint Control bit" name="USBIENCSR1__AUTORQ">
         <value caption="Meaning of bitfield depends on Host / Device mode of operation" name="" value="0x1"/>
         <value caption="Meaning of bitfield depends on Host / Device mode of operation" name="" value="0x0"/>
      </value-group>
      <value-group caption="RXPKTRDY Automatic Clear Control bit" name="USBIENCSR1__AUTOCLR">
         <value caption="RXPKTRDY will be automatically cleared when a packet of RXMAXP bytes has been unloaded from the RX FIFO. When packets of less than the maximum packet size are unloaded" name="" value="0x1L"/>
         <value caption="No automatic clearing of RXPKTRDY" name="" value="0x0"/>
      </value-group>
      <value-group caption="Operating Speed Control bits" name="USBIE0CSR2__SPEED">
         <value caption="Low-Speed" name="" value="0x3"/>
         <value caption="Full-Speed" name="" value="0x2"/>
         <value caption="Hi-Speed" name="" value="0x1"/>
         <value caption="Reserved" name="" value="0x0"/>
      </value-group>
      <value-group caption="TX Endpoint Protocol Control bits" name="USBIENCSR2__PROTOCOL">
         <value caption="Interrupt" name="" value="0x3"/>
         <value caption="Bulk" name="" value="0x2"/>
         <value caption="Isochronous" name="" value="0x1"/>
         <value caption="Control" name="" value="0x0"/>
      </value-group>
      <value-group caption="TX Endpoint Operating Speed Control bits (" name="USBIENCSR2__SPEED">
         <value caption="Low-Speed" name="" value="0x3"/>
         <value caption="Full-Speed" name="" value="0x2"/>
         <value caption="Hi-Speed" name="" value="0x1"/>
         <value caption="Reserved" name="" value="0x0"/>
      </value-group>
      <value-group caption="Soft Connect/Disconnect Option bit" name="USBIE0CSR3__SOFTCONE">
         <value caption="Soft Connect/Disconnect is supported" name="" value="0x1"/>
         <value caption="Soft Connect/Disconnect is not supported" name="" value="0x0"/>
      </value-group>
      <value-group caption="Dynamic FIFO Sizing Option bit" name="USBIE0CSR3__DYNFIFOS">
         <value caption="Dynamic FIFO sizing is supported" name="" value="0x1"/>
         <value caption="No Dynamic FIFO sizing" name="" value="0x0"/>
      </value-group>
      <value-group caption="High-bandwidth TX ISO Option bit" name="USBIE0CSR3__HBTXEN">
         <value caption="High-bandwidth TX ISO endpoint support is selected" name="" value="0x1"/>
         <value caption="No High-bandwidth TX ISO support" name="" value="0x0"/>
      </value-group>
      <value-group caption="High-bandwidth RX ISO Option bit" name="USBIE0CSR3__HBRXEN">
         <value caption="High-bandwidth RX ISO endpoint support is selected" name="" value="0x1"/>
         <value caption="No High-bandwidth RX ISO support" name="" value="0x0"/>
      </value-group>
      <value-group caption="Byte Ordering Option bit" name="USBIE0CSR3__BIGEND">
         <value caption="Big Endian ordering" name="" value="0x1"/>
         <value caption="Little Endian ordering" name="" value="0x0"/>
      </value-group>
      <value-group caption="Automatic Splitting Option bit" name="USBIE0CSR3__MPTXEN">
         <value caption="Automatic splitting of bulk packets is done" name="" value="0x1"/>
         <value caption="No automatic splitting" name="" value="0x0"/>
      </value-group>
      <value-group caption="Automatic Amalgamation Option bit" name="USBIE0CSR3__MPRXEN">
         <value caption="Automatic amalgamation of bulk packets is done" name="" value="0x1L"/>
         <value caption="No automatic amalgamation" name="" value="0x0"/>
      </value-group>
      <value-group caption="RX Endpoint Protocol Control bits" name="USBIENCSR3__PROTOCOL">
         <value caption="Interrupt" name="" value="0x3"/>
         <value caption="Bulk" name="" value="0x2"/>
         <value caption="Isochronous" name="" value="0x1"/>
         <value caption="Control" name="" value="0x0"/>
      </value-group>
      <value-group caption="RX Endpoint Operating Speed Control bits" name="USBIENCSR3__SPEED">
         <value caption="Low-Speed" name="" value="0x3"/>
         <value caption="Full-Speed" name="" value="0x2"/>
         <value caption="Hi-Speed" name="" value="0x1"/>
         <value caption="Reserved" name="" value="0x0"/>
      </value-group>
      <value-group caption="Transmit FIFO Size bits" name="USBIENCSR3__TXFIFOSZ">
         <value caption="Reserved" name="" value="0xf"/>
         <value caption="Reserved" name="" value="0xe"/>
         <value caption="8192 bytes" name="" value="0xd"/>
         <value caption="4096 bytes" name="" value="0xc"/>
         <value caption="2048 bytes" name="" value="0xb"/>
         <value caption="1024 bytes" name="" value="0xa"/>
         <value caption="512 bytes" name="" value="0x9"/>
         <value caption="256 bytes" name="" value="0x8"/>
         <value caption="128 bytes" name="" value="0x7"/>
         <value caption="64 bytes" name="" value="0x6"/>
         <value caption="32 bytes" name="" value="0x5"/>
         <value caption="16 bytes" name="" value="0x4"/>
         <value caption="8 bytes" name="" value="0x3"/>
         <value caption="Reserved" name="" value="0x2"/>
         <value caption="Reserved" name="" value="0x1"/>
         <value caption="Reserved or endpoint has not been configured" name="" value="0x0"/>
      </value-group>
      <value-group caption="Receive FIFO Size bits" name="USBIENCSR3__RXFIFOSZ">
         <value caption="Reserved" name="" value="0xfL"/>
         <value caption="Reserved" name="" value="0xeL"/>
         <value caption="8192 bytes" name="" value="0xdL"/>
         <value caption="4096 bytes" name="" value="0xcL"/>
         <value caption="2048 bytes" name="" value="0xbL"/>
         <value caption="1024 bytes" name="" value="0xaL"/>
         <value caption="512 bytes" name="" value="0x9L"/>
         <value caption="256 bytes" name="" value="0x8L"/>
         <value caption="128 bytes" name="" value="0x7"/>
         <value caption="64 bytes" name="" value="0x6"/>
         <value caption="32 bytes" name="" value="0x5"/>
         <value caption="16 bytes" name="" value="0x4"/>
         <value caption="8 bytes" name="" value="0x3"/>
         <value caption="Reserved" name="" value="0x2"/>
         <value caption="Reserved" name="" value="0x1"/>
         <value caption="Reserved or endpoint has not been configured" name="" value="0x0"/>
      </value-group>
      <value-group caption="Active Session Control/Status bit" name="USBOTG__SESSION">
         <value caption="(A device): Start a session / (B device): Session has started or is in progress" name="" value="0x1"/>
         <value caption="(A device): End a session / (B device): When USB module is in Suspend mode" name="" value="0x0"/>
      </value-group>
